app/views/hospitals/show.html.slim

SELECT  1 AS one FROM "doctors" WHERE "doctors"."hospital_id" = ? LIMIT 1  [["hospital_id", 6]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 6]]
---
  p = @hospital.address
- if @hospital.doctors.empty?