app/views/doctors/show.html.slim

SELECT  1 AS one FROM "records" WHERE "records"."doctor_id" = ? LIMIT 1  [["doctor_id", 3]]
---
  = link_to 'New record', new_hospital_doctor_record_path(@doctor.hospital_id, @doctor.id)
- if @doctor.records.empty?