app/controllers/doctors_controller.rb

  def show
    @doctor = @hospital.doctors.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ? AND "doctors"."id" = ? LIMIT 1  [["hospital_id", 4], ["id", 1]]

  def set_hospital
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 4]]