app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals" WHERE (name LIKE '%Hospital №1%')

  def show
    @hospital = Hospital.find(params[:id])
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 4]]