app/controllers/records_controller.rb

  def create
    @record = @doctor.records.new(record_params)
    if @record.save
---
INSERT INTO "records" ("name", "phone", "time_at", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_hospital
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT 1  [["id", 4]]

  def set_doctor
    @doctor = @hospital.doctors.find(params[:doctor_id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ? AND "doctors"."id" = ? LIMIT 1  [["hospital_id", 4], ["id", 1]]